maxgerhardt/micropython/ports/ch32/machine_spi.c
/* SPI1 hangs off HB2 but SPI2-4 are on HB1, so this cannot be one table.
 * (Note that the split is the other way round from I2C, where 1-3 are on HB1
 * and only I2C4 is on HB2.) */
static void machine_spi_clock_enable(uint8_t id) {
    if (id == 1) {
        RCC_HB2PeriphClockCmd(RCC_HB2Periph_SPI1, ENABLE);
        return;
    }
    static const uint32_t hb1[3] = {
        RCC_HB1Periph_SPI2, RCC_HB1Periph_SPI3, RCC_HB1Periph_SPI4,
    };
    RCC_HB1PeriphClockCmd(hb1[id - 2], ENABLE);
}

static void machine_spi_reset(uint8_t id) {
    if (id == 1) {
        RCC_HB2PeriphResetCmd(RCC_HB2Periph_SPI1, ENABLE);
        RCC_HB2PeriphResetCmd(RCC_HB2Periph_SPI1, DISABLE);
        return;
    }
    static const uint32_t hb1[3] = {
        RCC_HB1Periph_SPI2, RCC_HB1Periph_SPI3, RCC_HB1Periph_SPI4,
    };
    RCC_HB1PeriphResetCmd(hb1[id - 2], ENABLE);
    RCC_HB1PeriphResetCmd(hb1[id - 2], DISABLE);
}

/* SPI runs off HCLK. Ask RCC for it rather than using SystemCoreClock, which on
 * this part is the 400 MHz V5F core clock and four times too high -- the same
 * mistake that once had the whole timebase running 4x slow. */
static uint32_t machine_spi_periph_clock(void) {
    RCC_ClocksTypeDef clocks;
    RCC_GetClocksFreq(&clocks);
    return clocks.HCLK_Frequency;
}

/* The divider is a power of two from 2 to 256 (BR = 0..7), so an arbitrary
 * baudrate cannot be hit exactly. Round the clock *down* to the next available
 * step: a device with a documented maximum SCK must not be overclocked because
 * the arithmetic happened to land one step high.
 *
 * The one case that cannot honour that is a request below HCLK/256, about
 * 390 kHz, where the slowest available clock is still faster than asked. This
 * clamps rather than raising, because the upstream test suite asks for 100 kHz
 * and every other port clamps too -- but it does mean a request under 390 kHz
 * gets a *faster* bus than requested, so print(spi) is the only honest answer
 * and SoftSPI is the way to go slower. */
static uint8_t machine_spi_prescaler_for(uint32_t hclk, uint32_t baudrate) {
    for (uint8_t br = 0; br < 7; br++) {
        if ((hclk >> (br + 1)) <= baudrate) {
            return br;
        }
    }
    return 7;
}

/* Configure one pin as an alternate function of the SPI block.
 *
 * All three signals get AF push-pull, including MISO, which is an input. That
 * looks wrong and is not: on this part the alternate-function mux owns the
 * pad's output enable, so a pin whose selected function does not drive is not
 * driven. uart.c does exactly this for USART1 RX and has worked since the first
 * milestone. Configuring MISO as a plain floating input instead would be the
 * STM32F1 idiom, but this chip has an F4-style per-pin AF mux bolted onto
 * F1-style config registers, and in that arrangement the input only reaches the
 * peripheral once the mux is pointed at it. */
static void machine_spi_init_pin(uint8_t pin, uint8_t af) {
    machine_pin_clock_enable(pin);
    /* GPIO_PinAFConfig writes land in the AFIO block and are silently dropped
     * while its clock is off. */
    RCC_HB2PeriphClockCmd(RCC_HB2Periph_AFIO, ENABLE);

    GPIO_InitTypeDef init = {0};
    init.GPIO_Mode = GPIO_Mode_AF_PP;
    /* SCK can run at 50 MHz. A slow slew rate would round the edges into
     * unusable clocks well before that. */
    init.GPIO_Speed = GPIO_Speed_Very_High;
    init.GPIO_Pin = (uint16_t)(1u << MACHINE_PIN_NUM(pin));
    GPIO_Init(machine_pin_gpio(pin), &init);

    GPIO_PinAFConfig(machine_pin_gpio(pin), MACHINE_PIN_NUM(pin), af);
}

static void machine_spi_init_periph(machine_spi_obj_t *self) {
    machine_spi_clock_enable(self->id);

    /* Reset before reconfiguring. CTLR1 fields are documented as
     * "cannot be modified during communication", and re-running init on a bus
     * that is mid-transfer -- which is all that changing the baudrate does --
     * would otherwise leave the peripheral in a state the datasheet does not
     * define. */
    machine_spi_reset(self->id);

    SPI_InitTypeDef init = {0};
    init.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    init.SPI_Mode = SPI_Mode_Master;
    init.SPI_DataSize = SPI_DataSize_8b;
    init.SPI_CPOL = self->polarity ? SPI_CPOL_High : SPI_CPOL_Low;
    init.SPI_CPHA = self->phase ? SPI_CPHA_2Edge : SPI_CPHA_1Edge;
    /* Software slave management. Without it a master watching its NSS pin go
     * low decides another master has taken the bus, clears MSTR and stops. */
    init.SPI_NSS = SPI_NSS_Soft;
    init.SPI_BaudRatePrescaler = (uint16_t)(self->prescaler_log2 << 3);
    init.SPI_FirstBit = (self->firstbit == MICROPY_PY_MACHINE_SPI_LSB)
        ? SPI_FirstBit_LSB : SPI_FirstBit_MSB;
    init.SPI_CRCPolynomial = 7;

    SPI_Cmd(self->spi, DISABLE);
    SPI_Init(self->spi, &init);
    SPI_Cmd(self->spi, ENABLE);
}

/* Spin until `mask` is set in STATR. Returns 0 or -MP_ETIMEDOUT. */
static int machine_spi_wait(machine_spi_obj_t *self, uint16_t mask) {
    uint64_t deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
    while (!(self->spi->STATR & mask)) {
        if (mp_hal_ticks_us() > deadline) {
            return -MP_ETIMEDOUT;
        }
    }
    return 0;
}

/* Discard anything a previous transfer left in the receive path, so a stale
 * byte cannot be handed back as if it belonged to this one. Reading DATAR is
 * what clears RXNE; reading STATR afterwards clears OVR, which a write-only
 * transfer always leaves set because nothing collected its received bytes. */
static void machine_spi_drain(SPI_TypeDef *spi) {
    if (spi->STATR & SPI_STATR_RXNE) {
        (void)spi->DATAR;
    }
    (void)spi->STATR;
}

/* What read() clocks out when the caller gave nothing to send. At file scope
 * because the DMA reads it while machine_spi_transfer_dma() is asleep. */
static const uint8_t machine_spi_idle_byte = 0;

/* These exist only to end the WFI in machine_spi_dma_wait() promptly. Each
 * clears its own transfer-complete enable, so it fires once per transfer rather
 * than spinning on a flag nobody has cleared yet. */
void DMA1_Channel2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void DMA1_Channel2_IRQHandler(void) {
    SPI_DMA_RX->CFGR &= ~DMA_IT_TC;
    DMA1->INTFCR = SPI_DMA_RX_FLAGS;
}

void DMA1_Channel3_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void DMA1_Channel3_IRQHandler(void) {
    SPI_DMA_TX->CFGR &= ~DMA_IT_TC;
    DMA1->INTFCR = SPI_DMA_TX_FLAGS;
}

/* Sleep until `ch` has moved every byte. Returns false on timeout. */
static bool machine_spi_dma_wait(DMA_Channel_TypeDef *ch) {
    uint32_t left = ch->CNTR;
    uint64_t deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
    while (ch->CNTR != 0) {
        /* Gate the core clock rather than spin on CNTR: the transfer is the
         * DMA's work, not the CPU's, and at 390 kHz a full buffer is over a
         * second of otherwise wasted power.
         *
         * There is no wait-for-event race to lose here. The handler above has
         * already disabled its interrupt by the time CNTR reads zero, so a
         * completion that beats us to the test leaves the loop instead of
         * sleeping through it; and a WFI that does sleep is bounded by
         * SysTick's 1 ms tick regardless. */
        __WFI();
        uint32_t now = ch->CNTR;
        if (now != left) {
            left = now;
            deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
        } else if (mp_hal_ticks_us() > deadline) {
            return false;
        }
    }
    return true;
}

/* Returns false on timeout rather than raising, because the caller has DMA
 * channels and peripheral request lines to switch off first: raising from here
 * would leave a channel armed and writing into a buffer the GC is free to
 * reuse. */
static bool machine_spi_transfer_dma(machine_spi_obj_t *self, size_t len,
    const uint8_t *src, uint8_t *dest) {
    SPI_TypeDef *spi = self->spi;
    bool ok = true;

    RCC_HBPeriphClockCmd(RCC_HBPeriph_DMA1, ENABLE);
    DMA_MuxChannelConfig(SPI_DMA_TX_MUX, SPI_DMA_TX_REQ(self->id));
    DMA_MuxChannelConfig(SPI_DMA_RX_MUX, SPI_DMA_RX_REQ(self->id));
    NVIC_EnableIRQ(SPI_DMA_TX_IRQN);
    NVIC_EnableIRQ(SPI_DMA_RX_IRQN);

    while (len != 0 && ok) {
        uint16_t n = len > SPI_DMA_MAX_LEN ? SPI_DMA_MAX_LEN : (uint16_t)len;

        DMA_Cmd(SPI_DMA_TX, DISABLE);
        DMA_Cmd(SPI_DMA_RX, DISABLE);
        DMA1->INTFCR = SPI_DMA_TX_FLAGS | SPI_DMA_RX_FLAGS;

        /* Every field this leaves zero is already the wanted default: single
         * buffer, normal (non-circular) mode, byte to byte, not memory to
         * memory. DATAR does not move, so the peripheral address never
         * increments either. */
        DMA_InitTypeDef init = {0};
        init.DMA_PeripheralBaseAddr = (uint32_t)&spi->DATAR;
        init.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        init.DMA_BufferSize = n;

