maxgerhardt/micropython/ports/ch32/machine_spi.c
        if (dest != NULL) {
            /* Receive outranks transmit: a byte collected late is lost, while a
             * byte loaded late only leaves SCK idle for a moment. */
            init.DMA_DIR = DMA_DIR_PeripheralSRC;
            init.DMA_Memory0BaseAddr = (uint32_t)dest;
            init.DMA_MemoryInc = DMA_MemoryInc_Enable;
            init.DMA_Priority = DMA_Priority_VeryHigh;
            DMA_Init(SPI_DMA_RX, &init);
        }

        /* read() and readinto() hand the same buffer in as both source and
         * destination. That is safe without a copy: a byte has to be loaded
         * into DATAR before it can be shifted out, and the byte it exchanges
         * only lands two byte-times later, so the transmit side is always at
         * least two positions ahead of the receive side overwriting it. */
        init.DMA_DIR = DMA_DIR_PeripheralDST;
        init.DMA_Memory0BaseAddr = src != NULL
            ? (uint32_t)src : (uint32_t)&machine_spi_idle_byte;
        init.DMA_MemoryInc = src != NULL
            ? DMA_MemoryInc_Enable : DMA_MemoryInc_Disable;
        init.DMA_Priority = DMA_Priority_High;
        DMA_Init(SPI_DMA_TX, &init);

        machine_spi_drain(spi);

        /* Arm the receiver before anything can be received. WCH's example
         * enables the transmit side first, which at these clocks is a byte
         * lost: the first one can complete before the receive channel is
         * listening. */
        DMA_Channel_TypeDef *watch = SPI_DMA_TX;
        if (dest != NULL) {
            /* A completion left pending in the NVIC by an abandoned transfer
             * would run the handler the moment this is enabled, clearing the
             * TCIE that has just been set. The transfer would still finish, but
             * nothing would wake the wait, so it would crawl at SysTick's 1 ms
             * instead of ending when the last byte lands. */
            NVIC_ClearPendingIRQ(SPI_DMA_RX_IRQN);
            DMA_ITConfig(SPI_DMA_RX, DMA_IT_TC, ENABLE);
            DMA_Cmd(SPI_DMA_RX, ENABLE);
            SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Rx, ENABLE);
            watch = SPI_DMA_RX;
        } else {
            NVIC_ClearPendingIRQ(SPI_DMA_TX_IRQN);
            DMA_ITConfig(SPI_DMA_TX, DMA_IT_TC, ENABLE);
        }
        SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Tx, ENABLE);
        DMA_Cmd(SPI_DMA_TX, ENABLE);

        ok = machine_spi_dma_wait(watch);

        SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Tx, DISABLE);
        SPI_I2S_DMACmd(spi, SPI_I2S_DMAReq_Rx, DISABLE);
        DMA_ITConfig(SPI_DMA_TX, DMA_IT_TC, DISABLE);
        DMA_ITConfig(SPI_DMA_RX, DMA_IT_TC, DISABLE);
        DMA_Cmd(SPI_DMA_TX, DISABLE);
        DMA_Cmd(SPI_DMA_RX, DISABLE);

        len -= n;
        if (src != NULL) {
            src += n;
        }
        if (dest != NULL) {
            dest += n;
        }
    }
    return ok;
}

/* Write-only, and short enough that setting two DMA channels up would cost more
 * than the bytes do. Nothing is going to look at what came back, so let the
 * receive buffer overrun: OVR stops the receive path updating but transmission
 * carries on, and machine_spi_drain() clears it before the next transfer. */
static bool machine_spi_transfer_polled(machine_spi_obj_t *self, size_t len,
    const uint8_t *src) {
    for (size_t i = 0; i < len; i++) {
        if (machine_spi_wait(self, SPI_STATR_TXE) != 0) {
            return false;
        }
        self->spi->DATAR = src != NULL ? src[i] : 0;
    }
    return true;
}

static void machine_spi_transfer(mp_obj_base_t *self_in, size_t len,
    const uint8_t *src, uint8_t *dest) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    SPI_TypeDef *spi = self->spi;

    if (len == 0) {
        return;
    }

    /* Anything that has to be received goes through DMA however short it is.
     * The alternative would be a length at which a read starts working, which
     * is the worst kind of limit to document: polling cannot collect bytes at
     * the top of this peripheral's range at any length. Writes have no such
     * constraint -- an overrun costs a write nothing -- so short ones take the
     * cheaper path. The crossover was measured at about 24 bytes. */
    bool ok;
    if (dest != NULL || len >= SPI_DMA_MIN_LEN) {
        ok = machine_spi_transfer_dma(self, len, src, dest);
    } else {
        machine_spi_drain(spi);
        ok = machine_spi_transfer_polled(self, len, src);
    }

    /* Do not return while SCK is still moving: the caller's next act is
     * usually to raise CS, and doing that mid-byte truncates the frame. The
     * transmit DMA finishes one byte early for the same reason -- its last
     * write only reaches DATAR, not the wire. */
    uint64_t deadline = mp_hal_ticks_us() + SPI_TIMEOUT_US;
    while (ok && (spi->STATR & SPI_STATR_BSY)) {
        if (mp_hal_ticks_us() > deadline) {
            ok = false;
        }
    }

    if (!ok) {
        mp_raise_OSError(MP_ETIMEDOUT);
    }
}

static void machine_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    (void)kind;
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print,
        "SPI(%u, baudrate=%u, polarity=%u, phase=%u, bits=8, firstbit=%u, "
        "sck=P%c%u, mosi=P%c%u, miso=P%c%u)",
        self->id, self->baudrate, self->polarity, self->phase, self->firstbit,
        'A' + MACHINE_PIN_PORT(self->sck), MACHINE_PIN_NUM(self->sck),
        'A' + MACHINE_PIN_PORT(self->mosi), MACHINE_PIN_NUM(self->mosi),
        'A' + MACHINE_PIN_PORT(self->miso), MACHINE_PIN_NUM(self->miso));
}

/* Resolve one signal: the caller's pin if they named one and the mux can
 * produce it, otherwise the bus default. Returns the table entry so the caller
 * gets the alternate-function number with it. */
static const machine_spi_pin_t *machine_spi_find_pin(const machine_spi_pin_t *options,
    size_t n_options, uint8_t id, mp_obj_t requested, qstr what) {
    for (size_t i = 0; i < n_options; i++) {
        if (options[i].id != id) {
            continue;
        }
        if (requested == mp_const_none || machine_pin_get(requested)->id == options[i].pin) {
            return &options[i];
        }
    }
    mp_raise_msg_varg(&mp_type_ValueError,
        MP_ERROR_TEXT("SPI(%u) has no %q on that pin"), id, what);
}

