maxgerhardt/micropython/ports/ch32/machine_spi.c
static void machine_spi_configure(machine_spi_obj_t *self, size_t n_args,
    const mp_obj_t *pos_args, mp_map_t *kw_args, bool is_new) {
    enum { ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit,
           ARG_sck, ARG_mosi, ARG_miso };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_polarity, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_phase,    MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_firstbit, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    /* -1 means "not given". On a fresh object that becomes the default; on
     * init() it means "leave this setting alone", which is what lets
     * spi.init(baudrate=...) keep the pins and mode already in use. */
    uint32_t baudrate = SPI_DEFAULT_BAUDRATE;
    if (args[ARG_baudrate].u_int >= 0) {
        baudrate = args[ARG_baudrate].u_int;
    } else if (!is_new) {
        baudrate = self->baudrate;
    }
    if (baudrate == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("baudrate must be positive"));
    }

    if (args[ARG_bits].u_int >= 0 && args[ARG_bits].u_int != 8) {
        /* The peripheral can do 16, but only as whole 16-bit words with a
         * byte order the buffer protocol does not describe, so exposing it
         * would be a trap rather than a feature. */
        mp_raise_ValueError(MP_ERROR_TEXT("only bits=8 is supported"));
    }

    if (args[ARG_polarity].u_int >= 0) {
        self->polarity = args[ARG_polarity].u_int ? 1 : 0;
    } else if (is_new) {
        self->polarity = SPI_DEFAULT_POLARITY;
    }
    if (args[ARG_phase].u_int >= 0) {
        self->phase = args[ARG_phase].u_int ? 1 : 0;
    } else if (is_new) {
        self->phase = SPI_DEFAULT_PHASE;
    }
    if (args[ARG_firstbit].u_int >= 0) {
        self->firstbit = args[ARG_firstbit].u_int ? MICROPY_PY_MACHINE_SPI_LSB
            : MICROPY_PY_MACHINE_SPI_MSB;
    } else if (is_new) {
        self->firstbit = SPI_DEFAULT_FIRSTBIT;
    }

    bool pins_given = args[ARG_sck].u_obj != mp_const_none
        || args[ARG_mosi].u_obj != mp_const_none
        || args[ARG_miso].u_obj != mp_const_none;

    if (is_new || pins_given) {
        const machine_spi_pin_t *sck = machine_spi_find_pin(machine_spi_sck_options,
            MP_ARRAY_SIZE(machine_spi_sck_options), self->id, args[ARG_sck].u_obj, MP_QSTR_sck);
        const machine_spi_pin_t *miso = machine_spi_find_pin(machine_spi_miso_options,
            MP_ARRAY_SIZE(machine_spi_miso_options), self->id, args[ARG_miso].u_obj, MP_QSTR_miso);
        const machine_spi_pin_t *mosi = machine_spi_find_pin(machine_spi_mosi_options,
            MP_ARRAY_SIZE(machine_spi_mosi_options), self->id, args[ARG_mosi].u_obj, MP_QSTR_mosi);

        self->sck = sck->pin;
        self->miso = miso->pin;
        self->mosi = mosi->pin;

        machine_spi_init_pin(sck->pin, sck->af);
        machine_spi_init_pin(miso->pin, miso->af);
        machine_spi_init_pin(mosi->pin, mosi->af);
    }

    uint32_t hclk = machine_spi_periph_clock();
    self->prescaler_log2 = machine_spi_prescaler_for(hclk, baudrate);
    self->baudrate = hclk >> (self->prescaler_log2 + 1);

    machine_spi_init_periph(self);
}

static mp_obj_t machine_spi_make_new(const mp_obj_type_t *type, size_t n_args,
    size_t n_kw, const mp_obj_t *all_args) {
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    mp_int_t id = mp_obj_get_int(all_args[0]);
    if (id < 1 || id > 4) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) does not exist"), id);
    }

    machine_spi_obj_t *self = &machine_spi_obj[id - 1];
    self->base.type = type;
    self->spi = machine_spi_regs[id - 1];
    self->id = (uint8_t)id;

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);
    machine_spi_configure(self, n_args - 1, all_args + 1, &kw_args, true);

    return MP_OBJ_FROM_PTR(self);
}

static void machine_spi_init(mp_obj_base_t *self_in, size_t n_args,
    const mp_obj_t *pos_args, mp_map_t *kw_args) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    machine_spi_configure(self, n_args, pos_args, kw_args, false);
}

static void machine_spi_deinit(mp_obj_base_t *self_in) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    /* Drop the request lines before the clock: a peripheral left asking for DMA
     * would drive whichever bus claimed those two channels next. */
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Tx, DISABLE);
    SPI_I2S_DMACmd(self->spi, SPI_I2S_DMAReq_Rx, DISABLE);
    SPI_Cmd(self->spi, DISABLE);
    /* The pins keep their alternate function. Handing them back as inputs
     * would drop SCK and CS-adjacent lines to whatever the board pulls them
     * to, which is a worse default than leaving an idle bus idle. */
}

static const mp_machine_spi_p_t machine_spi_p = {
    .init = machine_spi_init,
    .deinit = machine_spi_deinit,
    .transfer = machine_spi_transfer,
};

MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    make_new, machine_spi_make_new,
    print, machine_spi_print,
    protocol, &machine_spi_p,
    locals_dict, &mp_machine_spi_locals_dict
    );
